Задание:
Создать в Jenkins джобу и написать скрипт для неё (декларативный groovy pipeline скрипт):
                параметры для запуска джобы
                               Поле ввода ФИО
                               Поле ввода почты e-mail
                               Поле ввода слейва на котором выполнится задание
                Первый стейдж: вывод в лог эхо «привет СБЕР, меня зовут «ФИО» и я хочу у вас работать»
                Второй стейдж апррув: – должно появиться окно ввода
                               «принять на работу»
                               «отказать»
По флагу «принять на работу» должно пойти дальше на следующий стейдж
По флагу «отказать» должно завершить работу джобы и повесить на билд бейдж о том, что кандидату «ФИО» отказано
                Третий стейдж – отправить письмо на «e-mail» с уведомлением. Текст: «ФИО» принят.
